Namespace:   Autodesk.Revit.DB.IFC
  Assembly:   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static IList<IFCExtrusionData> CalculateExtrusionData(
	IFCExtrusionCalculatorOptions extrInfo,
	IList<Face> allInputFaces
)
  Visual Basic
Public Shared Function CalculateExtrusionData ( _
	extrInfo As IFCExtrusionCalculatorOptions, _
	allInputFaces As IList(Of Face) _
) As IList(Of IFCExtrusionData)
  Visual C++
public:
static IList<IFCExtrusionData^>^ CalculateExtrusionData(
	IFCExtrusionCalculatorOptions^ extrInfo,
	IList<Face^>^ allInputFaces
)
 Parameters
  extrInfo
 Type:  Autodesk.Revit.DB.IFC IFCExtrusionCalculatorOptions
  allInputFaces
 Type:  System.Collections.Generic IList   Face
 See Also
  IFCExtrusionCalculatorUtils Class
  CalculateExtrusionData Overload
  Autodesk.Revit.DB.IFC Namespace